Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Learn more about how to develop reactive applications with Quarkus.
ja_jp: Quarkusを使用したリアクティブアプリケーションの開発については、こちらをご覧ください。

source: Learn more about how to use the web dependency locator
ja_jp: Web 依存性ロケーターの使用方法については、こちらをご覧ください。

source: Learn more about how you can pass contextual information with SmallRye Context Propagation.
ja_jp: SmallRye Context Propagationを使ってコンテキスト情報を渡す方法の詳細については、こちらをご覧ください。

source: Learn more about how you can send email from a Quarkus application with our reactive email client.
ja_jp: リアクティブメールクライアントを使用してQuarkusアプリケーションからメールを送信する方法について説明します。

source: Learn more about how you can use templating in your applications with the Qute template engine.
ja_jp: Quteのテンプレートエンジンを使ったアプリケーションでのテンプレートの使用方法については、こちらをご覧ください。

source: Learn more about how you extract content from documents using the Apache Tika toolkit.
ja_jp: Apache Tika ツールキットを使ってドキュメントからコンテンツを抽出する方法についての詳細はこちらをご覧ください。

source: Learn more about injecting Beans https://quarkus.io/guides/qute-reference#injecting-beans-directly-in-templates[here].
ja_jp: Beansインジェクションについて詳しくは link:https://quarkus.io/guides/qute-reference#injecting-beans-directly-in-templates[こちら]をご覧ください。

source: Learn more about it in the link:/guides/azure-functions[dedicated guide]
ja_jp: link:/guides/azure-functions[専用ガイド] で詳しく解説しています

source: Learn more about persistence and SQL Cache Stores check the https://github.com/infinispan-demos/infinispan-sqlstore-demo[SQL Store Demo + Quarkus Demo] and the https://infinispan.org/docs/stable/titles/configuring/configuring.html#persistence[Infinispan Persistence Documentation] guide.
ja_jp: 永続化とSQL Cache Storesの詳細については、 link:https://github.com/infinispan-demos/infinispan-sqlstore-demo[SQL Store Demo + Quarkus Demo] と link:https://infinispan.org/docs/stable/titles/configuring/configuring.html#persistence[Infinispan Persistence Documentation] ガイドをご覧ください。

source: Learn more about the Dev Assistant
ja_jp: Dev Assistant の詳細

source: Learn more about the Scheduler extension.
ja_jp: スケジューラーエクステンションの詳細はこちらをご覧ください。

source: Learn more about the base runtime image used by Quarkus for native executables and how you can tweak it.
ja_jp: Quarkusがネイティブ実行可能ファイルに使用するベースランタイムイメージと、その調整方法について詳しく説明します。

source: Learn more about the notion of extension registry and how you can use your own.
ja_jp: エクステンションレジストリの概念と、使用方法について詳しくご紹介します。

source: Learn more about what we call a Platform in the Quarkus world.
ja_jp: Quarkusの世界でプラットフォームと呼ばれているものについては、こちらをご覧ください。

source: Learn more in the https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod-client-intelligence_hotrod-java-client[Infinispan documentation].
ja_jp: 詳細は link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod-client-intelligence_hotrod-java-client[Infinispanのドキュメント] をご覧ください。

source: Learn more in the https://infinispan.org/documentation[Infinispan documentation].
ja_jp: 詳しくは、link:https://infinispan.org/documentation[Infinispanのドキュメント] をご覧ください。

source: Learn more in the xref:infinispan-dev-services.adoc[Infinispan Dev Services guide].
ja_jp: 詳しくは、 xref:infinispan-dev-services.adoc[Infinispan Dev Servicesのガイド] をご覧ください。

source: Learn step by step how to build a simple extension.
ja_jp: 簡単なエクステンションを構築する方法をステップバイステップで学ぶことができます。

source: Learning Curve
ja_jp: 学習曲線

source: Leave your JRE behind
ja_jp: JREを裏に隠す

source: Leaving the default as CDI is particularly useful for tests. In the following example a Span exporter class is wired with CDI and then the telemetry can be used in test code.
ja_jp: デフォルトを CDI のままにすることは、テストにとって特に有用です。以下の例では、Span エクスポータークラスが CDI とワイヤリングされ、テレメトリーがテストコードで使用できるようになっています。

source: Legacy API approach
ja_jp: 従来のAPIアプローチ

source: Legacy OpenTracing property
ja_jp: レガシー OpenTracing プロパティー

source: Lesson
ja_jp: レッスン

source: Let Quarkus use the already resolved tenant configuration if it has been resolved earlier.
ja_jp: 以前に解決されている場合は、すでに解決されたテナント設定を Quarkus が使用するようにします。

source: Let Quarkus use the already resolved tenant configuration if the already resolved tenant is expected for the current path.
ja_jp: 現在のパスに対してすでに解決されたテナントが予想される場合は、Quarkus がすでに解決されたテナント設定を使用するようにします。

source: Let Section
ja_jp: セクションを以下のようにする

source: Let `RequestScopedBean` a request-scoped bean, `ContextualEmitter` can be used to dispatch messages locally through the internal channel `app`:
ja_jp: `RequestScopedBean` をリクエストスコープの Bean とすると、`ContextualEmitter` を使用して、内部チャネル `app` を介してローカルにメッセージをディスパッチできます。

source: Let exceptions bubble up
ja_jp: 例外をバブルアップさせる

source: Let me present you two small new features in OpenAPI and Swagger UI: the ability to add the Health Endpoints and the ability to disable the UI and/or Schema at runtime.
ja_jp: OpenAPIとSwagger UIの2つの小さな新機能を紹介します。Health Endpointsを追加する機能と、実行時にUIやSchemaを無効にする機能です。

source: Let the Quarkus development mode run and in your IDE add the `@RateLimit` annotation to the `CoffeeResource#coffees()` method as follows and save the file:
ja_jp: Quarkus 開発モードを実行し、IDE で次のように `CoffeeResource#coffees()` メソッドに `@RateLimit` アノテーションを追加してファイルを保存します。

source: Let the Quarkus development server running and in your IDE add the `@Retry` annotation to the `CoffeeResource#coffees()` method as follows and save the file:
ja_jp: Quarkusの開発サーバーを稼働させ、IDEで以下のように `CoffeeResource#coffees()` メソッドに `@Retry` アノテーションを追加し、ファイルを保存します。

source: Let us assume that the Quarkus extension needs to provide a `Tracer` bean which application code is meant to inject into its own beans.
ja_jp: ここでは、Quarkusエクステンションが `Tracer` Bean を提供する必要があると仮定して、アプリケーションコードがそれ自身の Bean に注入することを意味します。

source: Let us create the `Legume` class, which will be serialized as JSON, following the same model as for our `Fruit` class:
ja_jp: `Fruit` クラスと同じモデルに従って、JSON としてシリアライズされる `Legume` クラスを作成してみましょう。

source: Let us do that and follow the same steps as before:
ja_jp: それを実行して、今までと同じ手順を踏んでみましょう。

source: Let with optional end tag
ja_jp: オプションの終了タグを持つ Let

source: Let's Encrypt uses link:https://datatracker.ietf.org/doc/html/rfc8555[Automated certificate management environment (ACME) protocol] to support automatic certificate issuance and renewal. To learn more about Let's Encrypt and ACME, see link:https://letsencrypt.org/docs/[Let's Encrypt documentation].
ja_jp: Let's Encrypt は、証明書の自動発行と自動更新をサポートするためにlink:https://datatracker.ietf.org/doc/html/rfc8555[自動証明書管理環境 (ACME) プロトコル] を使用します。 Let's Encrypt と ACME の詳細は、link:https://letsencrypt.org/docs/[Let's Encrypt のドキュメント] を参照してください。

source: Let's Encrypt uses the link:https://datatracker.ietf.org/doc/html/rfc8555[Automated Certificate Management Environment (ACME)] protocol to support automatic certificate issuance and renewal. To learn more about Let's Encrypt and ACME, see link:https://letsencrypt.org/docs/[Let's Encrypt documentation].
ja_jp: Let's Encrypt は、証明書の自動発行と更新をサポートするために link:https://datatracker.ietf.org/doc/html/rfc8555[自動証明書管理環境 (ACME)] プロトコルを使用します。Let's Encrypt と ACME の詳細は、 link:https://letsencrypt.org/docs/[Let's Encrypt のドキュメント] を参照してください。

source: Let's add `quarkus-undertow-deployment` as dependency to our `./greeting-extension/deployment/pom.xml`:
ja_jp: `quarkus-undertow-deployment` を依存関係として `./greeting-extension/deployment/pom.xml` に追加してみましょう。

source: Let's add a counter that tracks how often we test a number to see if it is prime. We'll add a dimensional label (also called an attribute or a tag) that will allow us to aggregate this counter value in different ways.
ja_jp: 数値が素数かどうかをテストする頻度を追跡するカウンターを追加しましょう。このカウンター値をさまざまな方法で集計できるようにするディメンションラベル (属性またはタグとも呼ばれます) を追加します。

source: Let's add a few methods in `LibraryResource`:
ja_jp: `LibraryResource` にいくつかのメソッドを追加してみましょう。

source: Let's add another step for creating a different endpoint using the imaginary `@Toaster` annotation, and for providing a corresponding test.
ja_jp: 架空の `@Toaster` アノテーションを使用して別のエンドポイントを作成し、対応するテストを提供するための別の手順を追加してみましょう。

source: Let's add the following code to that file:
ja_jp: そのファイルに以下のコードを追加してみましょう。

source: Let's also update `FilmResource` to allow clients to query for all allies:
ja_jp: また、 `FilmResource` を更新して、クライアントがすべての味方を照会できるようにしましょう。

source: Let's assume that our Quarkus application needs to talk to PostgreSQL and that when PostgreSQL was deployed on our Kubernetes cluster, a `Secret` named `postgresql` was created as part of that deployment and contains the following entries:
ja_jp: ここでは、QuarkusアプリケーションがPostgreSQLと通信する必要があり、PostgreSQLがKubernetesクラスタにデプロイされたときに、そのデプロイの一部として `postgresql` という名前の `Secret` が作成され、以下のエントリが含まれていたと仮定します。

source: Let's assume that our client only requires `title` and `releaseDate` making the previous call to the API `Over-fetching` of unnecessary data.
ja_jp: クライアントが必要としているのは `title` と `releaseDate` だけで、先ほどの API 呼び出しでは不要なデータを `Over-fetching` していたと仮定しましょう。

source: Let's assume that the configuration of a service is mapped thanks to a `@ConfigProperties` and you don't need this part of the configuration for your tests as it will be mocked, in that case you can define a build time condition like in the next example:
ja_jp: サービスの設定が `@ConfigProperties` にマッピングされていて、テストではこの設定部分はモックされるので必要ないとします。その場合は、次の例のようにビルド時の条件を定義します。

source: Let's assume that we have 3 registered mechanisms, mTLS, Basic and OIDC and you only require Basic and mTLS authentications to succeed to permit access to the `hello` method. In this case, enabling an inclusive authentication in a lax mode allows to check which mechanisms produced the identity as shown in the example below:
ja_jp: mTLS、Basic、OIDC の 3 つの登録済みメカニズムがあり、 `hello` メソッドへのアクセスを許可するのに Basic 認証と mTLS 認証のみが成功する必要があると仮定します。 この場合、統合認証を lax モードで有効にすると、次の例に示すように、どのメカニズムがアイデンティティーを生成したかを確認できます。

source: Let's assume we have a REST endpoint defined like so:
ja_jp: このようにRESTエンドポイントが定義されているとします。

source: Let's assume we have the `User` POJO on which we want to hide some field during serialization. A simple example of this is:
ja_jp: シリアル化中にフィールドを非表示にする `User` POJO があると仮定します。この簡単な例は次のとおりです。

source: Let's assume you have a Quarkus backend, and you want to serve static files. This is the most basic case, it is supported out of the box with all our Vert.x based extensions, you must place them in the `META-INF/resources` directory of your application.
ja_jp: まず、Quarkus のバックエンドがあり、静的ファイルを提供すると仮定します。これは最も基本的なケースで、すべての Vert.x ベースのエクステンションですぐに使用できますが、アプリケーションの `META-INF/resources` ディレクトリーに配置する必要があります。

source: Let's assume you have the following client:
ja_jp: 次のクライアントがあると仮定します。

source: Let's be clear: `aot-jar` performs worse than `fast-jar` when Project Leyden is not used.
ja_jp: はっきりさせておきますが、Project Leyden が使用されていない場合、`aot-jar` は `fast-jar` よりもパフォーマンスが劣ります。

source: Let's begin by creating a new class `InteractiveQueries` in the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/InteractiveQueries.java`:
ja_jp: まず、ファイル `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/InteractiveQueries.java` 内に `InteractiveQueries` を作成することから始めましょう:

source: Let's begin the implementation of the stream processing application by creating a few value objects for representing temperature measurements, weather stations and for keeping track of aggregated values.
ja_jp: ストリーム処理アプリケーションの実装を開始しましょう。温度測定、気象観測所を表現し、集約された値を追跡するためのいくつかの値オブジェクトを作成することから始めましょう。

source: Let's change the HTTP root path to `/root` so the impact it has on resource resolution is visible:
ja_jp: HTTP のルートパスを `/root` に変更して、リソース解決への影響が見えるようにしてみましょう。

source: Let's come back to Avro. Avro uses https://docs.oracle.com/javase/9/docs/api/java/lang/invoke/MethodHandles.html[method handles] that are not supported by the GraalVM native compiler.
ja_jp: Avro の話に戻りましょう。 Avro は GraalVM ネイティブコンパイラがサポートしていない https://docs.oracle.com/javase/9/docs/api/java/lang/invoke/MethodHandles.html[メソッドハンドル] を使用しています。

source: Let's consider having a simple entity with some constraints applied to its properties:
ja_jp: プロパティーにいくつかの制約が適用された単純なエンティティーを考えてみましょう。

source: Let's consider the following code:
ja_jp: 次のコードを考えてみましょう:

source: Let's consider the following scenario as an example: `quarkus-extension-a` has an optional dependency on `quarkus-extension-b` which should be included in a Quarkus application only if `quarkus-extension-c` is found among the application dependencies (direct or transitive). In this case, the presence of `quarkus-extension-c` is the condition, which, if satisfied, will trigger inclusion of the `quarkus-extension-b` when Quarkus application dependencies are resolved.
ja_jp: たとえば、次のシナリオを考えてみましょう。 `quarkus-extension-a` には `quarkus-extension-b` へのオプションの依存関係があり、これは、アプリケーションの依存関係 (直接的または推移的) の中に `quarkus-extension-c` が見つかった場合にのみ、Quarkus アプリケーションに含める必要があります。この場合、 `quarkus-extension-c` の存在が条件であり、これが満たされると、Quarkus アプリケーションの依存関係が解決されたときに `quarkus-extension-b` が含められます。

source: Let's consider the following scenarios:
ja_jp: 次のシナリオを考えてみましょう。

source: Let's continue our API with `getSingle`:
ja_jp: `getSingle` でAPIを継続してみましょう。

source: Let's continue to expand our GraphQL API by adding the following to the `FilmResource` class.
ja_jp: 引き続き、 `FilmResource` クラスに以下を追加して、GraphQL API を拡張してみましょう。

source: Let's continue with a simple CDI bean, that would work as a repository of our coffee samples.
ja_jp: 続いて、コーヒーのサンプルのrepositoryとして動作するシンプルなCDIビーンです。

source: Let's continue with an example CDI bean, that would work as a repository:
ja_jp: 引き続き、リポジトリとして動作するCDI Beanの例を見てみましょう。

source: Let's create `ConsumedMovieResource` that will consume `Movie` messages from the `movies-from-kafka` channel and will expose it via Server-Sent Events:
ja_jp: `movies-from-kafka` チャネルからの `Movie` メッセージを消費し、Server-Sent Event を介して公開する `ConsumedMovieResource` を作成します。

source: Let's create a PostgreSQL datasource.
ja_jp: それでは、PostgreSQLのデータソースを作成してみましょう。

source: Let's create a Quarkus App with a REST endpoint that serves atomic particle objects to be displayed in a React/Patternfly table. The sourcecode for the final application can be found https://github.com/nexus-Six/quarkus-gui-react-patternfly[here].
ja_jp: React/Patternflyのテーブルに表示される原子パーティクルオブジェクトを提供するRESTエンドポイントを持つQuarkus Appを作成してみましょう。最終的なアプリケーションのソースコードは link:https://github.com/nexus-Six/quarkus-gui-react-patternfly[こちら]にあります。

source: Let's create a `src/main/resources/import.sql` file with the following content (we'll reference it in configuration later):
ja_jp: 次の内容で `src/main/resources/import.sql` ファイルを作成しましょう (後で設定で参照します。

source: Let's create a `src/main/resources/import.sql` file with the following content:
ja_jp: 以下の内容の `src/main/resources/import.sql` ファイルを作成してみましょう。

source: Let's create a file called `acme-serve-http-requests-MyAcmeApplication.java`. While this is not a valid Java file name, it does sit nicely next to our tutorial source. We're going to rely on IDE magic for syntax checking.
ja_jp: `acme-serve-http-requests-MyAcmeApplication.java` というファイルを作成しましょう。これは有効な Java ファイル名ではありませんが、チュートリアルソースの隣にうまく配置されています。構文チェックには IDE マジックを使用します。

source: Let's create a new health check procedure `org.acme.microprofile.health.DataHealthCheck`:
ja_jp: 新しいヘルスチェック・プロシージャ `org.acme.microprofile.health.DataHealthCheck` を作成してみましょう:

source: Let's create a new project that contains both the Kubernetes and Jib extensions:
ja_jp: Kubernetes エクステンションとJib エクステンションの両方を含む新しいプロジェクトを作成してみましょう。

source: Let's create all the model classes and put them into the `org.acme.microprofile.graphql.client.model` package:
ja_jp: すべてのモデルクラスを作成して、 `org.acme.microprofile.graphql.client.model` パッケージに入れましょう:

source: Let's create an application in your account and deploy that repository to it:
ja_jp: 自分のアカウントでアプリケーションを作成し、そこにそのリポジトリをデプロイしてみましょう。

source: Let's create an end point validating the `Book` provided in the request:
ja_jp: リクエストで提供された `Book` を検証するエンドポイントを作成してみましょう。

source: Let's create an implementation of `QuarkusTestResourceLifecycleManager` called `MockAuthorizationServerTestResource` like so:
ja_jp: このように `QuarkusTestResourceLifecycleManager` の実装である `MockAuthorizationServerTestResource` を作成してみましょう:

source: Let's create an implementation of `QuarkusTestResourceLifecycleManager` called `WiremockExtensions` like so:
ja_jp: `WiremockExtensions` という名前で、 `QuarkusTestResourceLifecycleManager` の実装を以下のように作成します。

source: Let's create another project that does include a Kogito extension:
ja_jp: それでは、Kogitoエクステンションを含む別のプロジェクトを作ってみましょう。

source: Let's create the `Legume` class which will be serialized as JSON, following the same model as for our `Fruit` class:
ja_jp: `Fruit` クラスと同じモデルに従って、JSON としてシリアライズされる `Legume` クラスを作成してみましょう。

source: Let's disable SSL and see how it goes
ja_jp: では、SSLを無効にしてどうなるか見てみましょう

source: Let's do a little tour.
ja_jp: ちょっと見てみましょう。

source: Let's do that and follow the same steps as before:
ja_jp: それを実行して、今までと同じ手順を踏んでみましょう。

source: Let's edit the `Author` entity to include this content:
ja_jp: この内容を含めるように `Author` エンティティーを編集してみましょう。

source: Let's edit the `Book` entity again to include this content:
ja_jp: `Book` エンティティを再度編集して、この内容を入れてみましょう:

source: Let's explore briefly different producer/consumer patterns and how to implement them using Quarkus:
ja_jp: ここでは、さまざまなプロデューサー/コンシューマーパターンと、Quarkus を使用したその実装方法について簡単に説明します。

source: Let's first add a simple endpoint that calculates prime numbers.
ja_jp: まず、素数を計算する単純なエンドポイントを追加してみましょう。

source: Let's get reactive
ja_jp: リアクティブにしてみよう

source: Let's get something to compress
ja_jp: 圧縮するものを準備

source: Let's give our heroes some allies.
ja_jp: ヒーローに味方をつけてみましょう。

source: Let's go again to http://localhost:8080/q/dev-ui, select the `OpenId Connect` card, login to Auth0, and check the Access token content:
ja_jp: 再度 http://localhost:8080/q/dev-ui にアクセスし、 `OpenId Connect` カードを選択して Auth0 にログインし、アクセストークンの内容を確認します。

source: Let's go back to our entities.
ja_jp: エンティティに戻りましょう。

source: Let's go back to the `run` method. It contains the application logic, here, a dummy Vert.x application. It creates the `Vertx` instance, a `Router`, registers a few routes, and starts the HTTP server. Because we don't want the application to stop immediately, we _wait for exit_. The `/bye` request handler illustrates how you can programmatically trigger the application shutdown.
ja_jp: `run` メソッドに戻りましょう。これにはアプリケーション・ロジックが含まれており、ここではダミーの Vert.x アプリケーションを使用しています。 `Vertx` インスタンス、 `Router` を作成し、いくつかのルートを登録し、HTTP サーバーを起動します。アプリケーションをすぐに停止させたくないので、 _終了を待ちます_。 `/bye` リクエスト・ハンドラーは、アプリケーションのシャットダウンをプログラムでトリガーする方法を示しています。

source: Let's go through some examples of how paths resolve using our new rules. We'll start with the following assumptions:
ja_jp: 新しいルールを使用してパスがどのように解決されるか、いくつかの例を見てみましょう。まず、以下の前提条件から始めましょう。

source: Let's go to http://localhost:8080/q/dev-ui, select the `OpenId Connect` card, login to Auth0, and check the Access token content:
ja_jp: http://localhost:8080/q/dev-ui に移動して `OpenId Connect` カードを選択し、Auth0 にログインし、アクセストークンの内容を確認します。

source: Let's go to the OIDC Dev UI where we looked at the access token, enter `/hello` as the `Service Address` in the `Test Service` area and press `With Access Token` and you will get `200`:
ja_jp: アクセストークンを確認した OIDC Dev UI に移動し、 `Test Service` 領域の `Service Address` として `/hello` を入力し、 `With Access Token` を押すと `200` が返されます。

source: Let's have a component `Foo` - a CDI bean with two injection points.
ja_jp: 2 つのインジェクションポイントを持つ CDI Bean であるコンポーネント `Foo` があるとします。

source: Let's have a look at how it can be done.
ja_jp: その方法を見てみましょう。

source: Let's have a look at the deployment's `./greeting-extension/deployment/pom.xml`.
ja_jp: デプロイメントの `./quarkus-greeting/deployment/pom.xml` を見てみましょう。

source: Let's identify the methods
ja_jp: メソッドを特定しよう

source: Let's imagine a simple structure representing an element from the https://en.wikipedia.org/wiki/Periodic_table[periodic table]:
ja_jp: link:https://en.wikipedia.org/wiki/Periodic_table[周期表]の元素を表す簡単な構造を想像してみましょう。

source: Let's imagine the following process:
ja_jp: 以下のプロセスを想像してみましょう。

source: Let's imagine though that the Quarkus endpoint we have developed has to accept `Bearer` access tokens too: it may be that the other Quarkus endpoint which is propagating it to this endpoint or it can be SPA which uses the access token to access the Quarkus endpoint. And Quarkus OIDC DevUI SPA which we already used to analyze the ID token fits perfectly for using the access token available to SPA to test the Quarkus endpoint.
ja_jp: しかし、開発した Quarkus エンドポイントも `ベアラー` アクセストークンを受け入れる必要があると想像してみてください。このエンドポイントにそれを伝播している他の Quarkus エンドポイントかもしれませんし、アクセストークンを使用して Quarkus エンドポイントにアクセスする SPA かもしれません。その場合、すでに ID トークンの分析に使用した Quarkus OIDC DevUI SPA は、SPA が使用できるアクセストークンを使用して Quarkus エンドポイントをテストするのに最適です。

source: Let's imagine you have a regular Quarkus project, generated from the https://code.quarkus.io[Quarkus project generator]. The default configuration is enough, but you can also select some extensions if you want.
ja_jp: ここでは、 link:https://code.quarkus.io[Quarkusプロジェクトジェネレータ] から生成された通常のQuarkusプロジェクトを想像してみましょう。デフォルトの設定で十分ですが、必要に応じていくつかのエクステンションを選択することもできます。

source: Let's imagine you have an application deployed in Kubernetes and exposing an HTTP API. You declare a Kubernetes service that delegates the calls to your application. This service acts as a proxy in front of a set of pods (often application replicas). When another application calls our HTTP API, it uses DNS to locate the Kubernetes service and uses the resolved address. It's important to understand that it does not locate and call the application instance but the Kubernetes service. This service then delegates the call to the actual application and implements a round-robin when there are multiple replicas.
ja_jp: Kubernetesにデプロイされたアプリケーションがあり、HTTP APIを公開しているとします。アプリケーションへの呼び出しを委譲するKubernetesサービスを宣言すると、このサービスは、一連のポッド（多くの場合、アプリケーションのレプリカ）の前でプロキシとして動作します。他のアプリケーションが私たちのHTTP APIを呼び出すと、DNSを使ってKubernetesサービスを探し出し、解決したアドレスを使用します。ここで重要なのは、アプリケーションのインスタンスを探して呼び出すのではなく、Kubernetesサービスを呼び出すということです。そしてこのサービスは、実際のアプリケーションに呼び出しを委ね、複数のレプリカがある場合はラウンドロビンを実装します。

source: Let's imagine you receive `Fruit` objects. For simplicity purposes, our `Fruit` class is pretty simple:
ja_jp: `Fruit` オブジェクトを受け取ったと想像してみましょう。簡単にするために、 `Fruit` クラスは非常に単純です。

source: Let's imagine you want to expose in your Quarkus application a REST API that allows users to retrieve the weather forecast for the next three days. The problem is that you have to rely on an external meteorological service which only accepts requests for one day at a time and takes forever to answer. Since the weather forecast is updated once every twelve hours, caching the service responses would definitely improve your API performances.
ja_jp: Quarkusアプリケーションで、ユーザーが今後3日間の天気予報を取得できるREST APIを公開したいとします。問題は、一度に1日分のリクエストしか受け付けず、応答に時間がかかる外部の気象サービスに依存しなければならないことです。天気予報は12時間に一度更新されるので、サービスのレスポンスをキャッシュすればAPIのパフォーマンスは間違いなく向上します。

source: Let's imagine your application receives `Message<Double>`. You can consume the payload directly:
ja_jp: アプリケーションが `メッセージ <Double>` を受信すると想像してみましょう。ペイロードを直接消費できます。

source: Let's imagine, although it's not implemented as such, that some methods in our endpoint require communication to external services like a database or an external microservice, which introduces a factor of unreliability.
ja_jp: そのような実装はされていませんが、エンドポイントのいくつかのメソッドが、データベースや外部のマイクロサービスなどの外部サービスとの通信を必要とし、信頼性の低い要素を導入することを想像してみましょう。

source: Let's imagine, although it's not implemented as such, that some of the methods in our endpoint require communication to external services like a database or an external microservice, which introduces a factor of unreliability.
ja_jp: このように実装されてはいませんが、エンドポイント内のメソッドの一部がデータベースや外部マイクロサービスなどの外部サービスとの通信を必要とし、信頼性の低い要素を導入していることを想像してみましょう。

source: Let's just re-use a broadly used and well tested Go library, calling exported functions from Java, in a sandboxed, secure way, and be happy with it!
ja_jp: 広く使用され、十分にテストされた Go ライブラリーを再利用しましょう。Java からエクスポートされた関数をサンドボックス化された安全な方法で呼び出すだけで、すべてが解決します。
